app/controllers/events_controller.rb

INSERT INTO "events" ("name", "start", "end", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @event = Event.new(event_params)
    if @event.save

UPDATE "events" SET "name" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["name", "Conference"], ["updated_at", "2015-06-04 23:54:35.590018"], ["id", 3]]
---
  def update
    if @event.update_attributes(event_params)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 3]]
---
    def find_event
      @event = Event.find(params[:id])