app/controllers/tasks_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 3]]
---
  def find_event
    @event = Event.find(params[:event_id]) # find a specific event

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 15]]
---
  def find_task
    @task = @event.tasks.find(params[:id]) #find a specific task